[
    {
      "year": 1,
      "images": [
        {
          "image": "images/1-1.jpg",
          "text": "."
        },
        {
          "image": "images/1-2.jpg",
          "text": "."
        },
        {
          "image": "images/1-3.jpg",
          "text": "."
        },
        {
          "image": "images/1-4.jpg",
          "text": "."
        },
        {
            "image": "images/1-5.jpg",
            "text": "."
        },
        {
            "image": "images/1-6.png",
            "text": "."
        },
        {
            "image": "images/1-7.jpg",
            "text": "."
        },
        {
            "image": "images/1-8.jpg",
            "text": "."
        },
        {
            "image": "images/1-9.jpg",
            "text": "."
        },
        {
            "image": "images/1-10.jpg",
            "text": "."
        }
      ]
    },
    {
      "year": 2,
      "images": [
        {
            "image": "images/2017/2-1.jpg",
            "text": "Our very first trip away together at Ocean Shores. We felt so grown-up going away just the two of us, even if it was to Ocean Shores during off season. Our trips are nicer now but even back then they were still full."
        },
        {
            "image": "images/2017/2-2.jpg",
            "text": "On a walk through a park in the Tacoma or Puyallup area. This was at the end of an outing around the city and we just wanted to slow things down. Also one of my favorite photos."
        },
        {
            "image": "images/2017/2-3.jpg",
            "text": "Exploring the Point Defiance Rose Garden together. There were so many couples there taking professional photos and this was about as professional as we got."
        },
        {
            "image": "images/2017/2-4.jpg",
            "text": "On a random trip out through Fred Meyer, something we still do today. I'm not sure why you wanted a photo with this or why we thought this was funny. I think our sense of humor has evolved since then."
        },
        {
            "image": "images/2017/2-5.jpg",
            "text": "Photo of Showbox listing Royal Blood! This was our first concert together. It took a long time for us to make it back home, before stopping at Denny's, having an okay(?) meal, before me getting pulled over for having my headlights off. Oops."
        },
        {
            "image": "images/2017/2-6.jpg",
            "text": "Lincoln City with your family! A long drive but well worth it. The place we got to stay was beautiful and I got to turn you into a sand mermaid. Absolutely a win."
        },
        {
            "image": "images/2017/2-7.jpg",
            "text": "More trips with your family, this time to Idaho for Thanksgiving to spend time with your dad's side of the family. I remember walking through Idaho's Christmas lights and watching a movie together with the whole family that had an unsatisfying ending."
        },
        {
            "image": "images/2017/2-8.jpg",
            "text": "Photo of us stopped at WSU to take a photo with their cougar statue. It's lucky neither of us went, long distance would have been extremely unpleasant. Just two huskies and a cat."
        },
        {
            "image": "images/2017/2-9.jpg",
            "text": "Even back then we were going to Target and finding gems like this. I remember you were adamant about buying it before seeing the price tag. It is sad that the sweater didn't hold up as well as we were hoping."
        },
        {
            "image": "images/2017/2-10.jpg",
            "text": "Christmas dinner at my mom's apartment back in Tacoma. Steak cooked by Isaac and a sort of potluck assortment from things we brought. My family was smaller back then without grandkids but you fit in really well."
        }
      ]
    },
    {
      "year": 3,
      "images": [
        {
            "image": "images/2018/3-1.jpg",
            "text": "The fact that this photo was taken in 2018 makes you realize how old your Nashville hat is. Happy photo of us at West Hylebos Wetlands."
        },
        {
            "image": "images/2018/3-2.jpg",
            "text": "My very first baseball game! The kettle corn was delicious, the temperatures warm, but it was a great experience. Appreciate you sharing these firsts with me."
        },
        {
            "image": "images/2018/3-3.jpg",
            "text": "This was Richie and Jeffrey's first time meeting you. We got Mod Pizza and explored UW Tacoma. You made a good first impression by packing up a slice of pizza to take home and you didn't even know it. They loved that you weren't wasteful."
        },
        {
            "image": "images/2018/3-4.jpg",
            "text": "A photo from the very first day getting the keys to our apartment. We were so excited to move in together that we slept on the floor on yoga mats and had Pho Tai in the fridge. We don't go to Pho Tai anymore but the floor is still a bed."
        },
        {
            "image": "images/2018/3-5.jpg",
            "text": "A foggy morning run. After moving in we took that opportunity to take advantage of how walkable our location was and ran on the BPA trail regularly weekend mornings before stopping at Poverty Bay for breakfast."
        },
        {
            "image": "images/2018/3-6.jpg",
            "text": "Spending a day out in Renton. This picture is actually really special to me because it was taken by Kay and made me realize how much you were becoming part of the family."
        },
        {
            "image": "images/2018/3-7.jpg",
            "text": "If we didn't need more proof you were part of the family, we went out with them for Halloween! Free food, family time, and getting to see Ethan in a cute costume."
        },
        {
            "image": "images/2018/3-8.jpg",
            "text": "A silly photo from the Pearl Jam concert we went to on your birthday! I asked this man to take a photo then asked if he wanted to be in the photo as well. I'm so glad he said yes!"
        },
        {
            "image": "images/2018/3-9.jpg",
            "text": "After my first wisdom teeth surgery. We found out that tight hoodie strings were great at holding the ice packs against my cheeks. Remember how often the art behind me fell down? It's probably a good thing we ended up selling it."
        },
        {
            "image": "images/2018/3-10.jpg",
            "text": "Getting to meet the wolves in Anacortes. This wasn't super ethical but we've learned since, and it was still a really cool experience. Even without the wolves, getting to explore the small town with you was so lovely."
        }
      ]
    },
    {
      "year": 4,
      "images": [
        {
            "image": "images/2019/4-1.jpg",
            "text": "Our very first addition to the family. We weren't sure if we were going to be bringing home that day which led to us panic buying supplies the day of. I'll never forget him sleeping between us the very first night, and subsequent nights."
        },
        {
            "image": "images/2019/4-2.jpg",
            "text": "A little work memory and cat memory. I don't remember why you were gifted this gear by McKinstry but we thought it was very important to do a photoshoot with the cat."
        },
        {
            "image": "images/2019/4-3.jpg",
            "text": "If it wasn't already obvious that we were obsessed with Totoro, we did paint your own pottery where you painted Totoro with his chicken hat and I painted a food plate for him."
        },
        {
            "image": "images/2019/4-4.jpg",
            "text": "This was taken at Lake Meridian Park. This was near one of our very first apartments when my family immigrated here and I went to this park a lot when I was small. It felt really full circle bringing you there."
        },
        {
            "image": "images/2019/4-5.jpg",
            "text": "The lavender photoshoot. I still can't believe we got asked to participate in a styled shoot and got those beautiful photos for free. After that experience we talked about owning a lavender farm one day."
        },
        {
            "image": "images/2019/4-6.jpg",
            "text": "Our first international trip together. It was only four days but it was honestly such a fantastic one in my memory where we got to enjoy good food and do all the touristy things."
        },
        {
            "image": "images/2019/4-7.jpg",
            "text": "The most important thing about Vancouver was our introduction to the pannenkoeken, the most delicious breakfast food on the planet. I remember the day we left Vancouver, we woke up ridiculously early just to have breakfast there before leaving."
        },
        {
            "image": "images/2019/4-8.jpg",
            "text": "Getting to see the beautiful mountains and lake below as we hiked through Naches Peak Loop. I still can't get over how beautiful the sites were for only about a three mile, very easy hike."
        },
        {
            "image": "images/2019/4-9.jpg",
            "text": "One of our very early trips to Leavenworth. It feels like it's only gotten busier since but at the time nothing was more fun than wandering around late at night to enjoy the snow."
        },
        {
            "image": "images/2019/4-10.jpg",
            "text": "It turned out we didn't even need to go to Leavenworth for snow! This was unfortunately the time my phone fell out of my pocket on our way to Celebration Park to play in the snow and we had to panic search in the snow."
        }
      ]
    },
    {
      "year": 5,
      "images": [
        {
            "image": "images/5-1.jpeg",
            "text": "."
        },
        {
            "image": "images/5-2.jpeg",
            "text": "."
        },
        {
            "image": "images/5-3.jpeg",
            "text": "."
        },
        {
            "image": "images/5-4.jpeg",
            "text": "."
        },
        {
            "image": "images/5-5.jpeg",
            "text": "."
        },
        {
            "image": "images/5-6.jpeg",
            "text": "."
        },
        {
            "image": "images/5-7.jpeg",
            "text": "."
        },
        {
            "image": "images/5-8.jpeg",
            "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/b09c74/4e4125?text=2019-9",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/b09c74/4e4125?text=2019-10",
          "text": "."
        }
      ]
    },
    {
      "year": 6,
      "images": [
        {
            "image": "images/2021/6-1.jpg",
          "text": "One of our earliest photos of Mei. We weren't expecting to get a dog before leaving the apartment and especially not a three-legged one from a rescue. I'm so grateful that we put in an application for her though and got to bring her into our lives. "
        },
        {
            "image": "images/2021/6-2.jpg",
          "text": "The beginning of our love affair with the Italian sandwich, a Valentine's day activity that we did online. Mei was being especially anxious and whiny that day and I remember we felt really frustrated before putting a cover over her crate. Now she gets free reign of the house."
        },
        {
            "image": "images/2021/6-3.jpg",
          "text": "Snow in the apartment complex! It was late at night but we wanted Mei to experience and play in the snow. I don't think we were expecting to have that experience as early as we did but it was wonderful to find out how much she loved it."
        },
        {
            "image": "images/2021/6-4.jpg",
          "text": "Our wedding day. Still one of the happiest days of my life. I wasn't expecting for us to cry during our vows but of course we did. It was a little bit cold and misty at Ruby Beach but it couldn't have been a more beautiful setting to say I do to the rest of our lives."
        },
        {
            "image": "images/2021/6-5.jpg",
          "text": "Taking Mei out on a walk through Redondo Beach. She was a little bit anxious when it came to walking on the boards, I think because she could tell there was water underneath. She got over it quick though and we got to enjoy the beautiful sunset."
        },
        {
            "image": "images/2021/6-6.jpg",
          "text": "We took this photo right after taking Mei to Say Woof studio in Seattle. They were hosting a mini session for mother's day photos and we got the beautiful professional photo of Mei before taking a walk through the nearby park."
        },
        {
            "image": "images/2021/6-7.jpg",
          "text": "After closing on our house! Spending some time in the backyard and seeing Totoro enjoy birdwatching from our bedroom window. I think he appreciated being on the ground floor and getting to look around outside."
        },
        {
            "image": "images/2021/6-8.jpg",
          "text": "We did so many renovations to the house. Of course this one was taken before the disaster of the asbestos but it let to a funny story. I can't believe how different the house looks now and how much I love it."
        },
        {
            "image": "images/2021/6-9.jpg",
          "text": "After putting up the Christmas lights for the very first time. I think we expected it to be a little bit easier and more satisfying but it still felt good to decorate our very own house. This was back when the giant rock in the lawn was still haunting us."
        },
        {
            "image": "images/2021/6-10.jpg",
          "text": "Our very first winter and we got to enjoy so much snow. We played with Mei in the backyard and watched this snowman melt from the office window. This was back when we didn't realize having dogs would absolutely destroy the backyard."
        }
      ]
    },
    {
      "year": 7,
      "images": [
        {
          "image": "https://via.placeholder.com/400x400/98844c/322509?text=2021-1",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/98844c/322509?text=2021-2",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/98844c/322509?text=2021-3",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/98844c/322509?text=2021-4",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/98844c/322509?text=2021-5",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/98844c/322509?text=2021-6",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/98844c/322509?text=2021-7",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/98844c/322509?text=2021-8",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/98844c/322509?text=2021-9",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/98844c/322509?text=2021-10",
          "text": "."
        }
      ]
    },
    {
      "year": 8,
      "images": [
        {
            "image": "images/2023/8-1.jpg",
          "text": "Glassblowing at the Tacoma Glass Studio. I was really bad at this and I didn't even know you could be bad at something that someone assists you with until they start to just take over it themselves."
        },
        {
            "image": "images/2023/8-2.jpg",
          "text": "The silliest but funnest convention in the world. I loved the shirt that we got from it and all the fun art that we bought. I know I'm cat crazy and I think it's cute you just embraced it with me."
        },
        {
            "image": "images/2023/8-3.jpg",
          "text": "Richie and Jeffrey coming over to the US and staying at our play for a delicious hot pot dinner. I still think this is the most people we've ever had in the house, but it felt so nice that the whole family was sat for dinner."
        },
        {
            "image": "images/2023/8-4.jpg",
          "text": "Mei and Yuna's shining moment at the Seattle Humane's Tuxes and Tails gala. I don't know how we keep getting free opportunities to do such amazing things but this was really an unforgettable night, even if Yuna was camera shy."
        },
        {
            "image": "images/2023/8-5.jpg",
          "text": "Your first time at the race tracks! We went to go see the weiner dogs race at Emerald Downs."
        },
        {
            "image": "images/2023/8-6.jpg",
          "text": "."
        },
        {
            "image": "images/2023/8-7.jpg",
          "text": "."
        },
        {
            "image": "images/2023/8-8.jpg",
          "text": "."
        },
        {
            "image": "images/2023/8-9.jpg",
          "text": "."
        },
        {
            "image": "images/2023/8-10.jpg",
          "text": "."
        }
      ]
    },
    {
      "year": 9,
      "images": [
        {
            "image": "images/2024/9-1.jpg",
          "text": "."
        },
        {
            "image": "images/2024/9-2.jpg",
          "text": "."
        },
        {
            "image": "images/2024/9-3.jpg",
          "text": "."
        },
        {
            "image": "images/2024/9-4.jpg",
          "text": "."
        },
        {
            "image": "images/2024/9-5.jpg",
          "text": "."
        },
        {
            "image": "images/2024/9-6.jpg",
          "text": "."
        },
        {
            "image": "images/2024/9-7.jpg",
          "text": "."
        },
        {
            "image": "images/2024/9-8.jpg",
          "text": "."
        },
        {
            "image": "images/2024/9-9.jpg",
          "text": "."
        },
        {
            "image": "images/2024/9-10.jpg",
          "text": "."
        }
      ]
    },
    {
      "year": 10,
      "images": [
        {
          "image": "https://via.placeholder.com/400x400/746010/0a0000?text=2024-1",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/746010/0a0000?text=2024-2",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/746010/0a0000?text=2024-3",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/746010/0a0000?text=2024-4",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/746010/0a0000?text=2024-5",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/746010/0a0000?text=2024-6",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/746010/0a0000?text=2024-7",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/746010/0a0000?text=2024-8",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/746010/0a0000?text=2024-9",
          "text": "."
        },
        {
          "image": "https://via.placeholder.com/400x400/746010/0a0000?text=2024-10",
          "text": "."
        }
      ]
    }
  ]